oriflame/src/test/resources/pior_cross.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <INBOUND_ORDER_RECEIPT xmlns="urn:ifsworld-com:schemas:post_inbound_order_receipt">
            <DATE_CREATED>2013-05-08T00:00:00.000+00:00</DATE_CREATED>
            <DELIVERY_DATE>2013-05-08T00:00:00.000+00:00</DELIVERY_DATE>
            <INBOUND_COMPLETE>1</INBOUND_COMPLETE>
            <ORDER_NO>30368</ORDER_NO>
            <ORDER_TYPE>CROSSDOCK_ORDER</ORDER_TYPE>
            <SITE>DCBUD</SITE>
            <VENDOR_NO>WDPLE</VENDOR_NO>
            <INBOUND_ORDER_RECEIPT_PALLETS>
                <INBOUND_ORDER_RECEIPT_PALLET>
                    <PALLET_ID>F3157713</PALLET_ID>
                    <INBOUND_ORDER_RECEIPT_LINES>
                        <INBOUND_ORDER_RECEIPT_LINE>
                            <BATCH_NO>DUM20150701</BATCH_NO>
                            <BOX_SIZE>210.0</BOX_SIZE>
                            <BOX_WEIGHT>4.49</BOX_WEIGHT>
                            <COUNTRY_OF_ORIGIN>PL</COUNTRY_OF_ORIGIN>
                            <CUSTOMS_STAT_NO>330420000</CUSTOMS_STAT_NO>
                            <DELNOTE_NO>136673</DELNOTE_NO>
                            <DIMENSIONS>0.39x0.355x0.12</DIMENSIONS>
                            <EXPIRY_DATE>2013-05-08T00:00:00.000+00:00</EXPIRY_DATE>
                            <LOCATION_NO>O</LOCATION_NO>
                            <PART_NO>26195.1</PART_NO>
                            <QUANTITY>6930.0</QUANTITY>
                            <REMARKS>GTP1900003</REMARKS>
                            <SEQUENCE_NO>10.0</SEQUENCE_NO>
                        </INBOUND_ORDER_RECEIPT_LINE>
                    </INBOUND_ORDER_RECEIPT_LINES>
                </INBOUND_ORDER_RECEIPT_PALLET>
                <INBOUND_ORDER_RECEIPT_PALLET>
                    <PALLET_ID>F3157714</PALLET_ID>
                    <INBOUND_ORDER_RECEIPT_LINES>
                        <INBOUND_ORDER_RECEIPT_LINE>
                            <BATCH_NO>DUMMY</BATCH_NO>
                            <BOX_SIZE>92.0</BOX_SIZE>
                            <BOX_WEIGHT>2.75</BOX_WEIGHT>
                            <COUNTRY_OF_ORIGIN>CN</COUNTRY_OF_ORIGIN>
                            <CUSTOMS_STAT_NO>821210100</CUSTOMS_STAT_NO>
                            <DELNOTE_NO>136673</DELNOTE_NO>
                            <DIMENSIONS>0.36x0.33x0.175</DIMENSIONS>
                            <EXPIRY_DATE>2013-05-08T00:00:00.000+00:00</EXPIRY_DATE>
                            <LOCATION_NO>O</LOCATION_NO>
                            <PART_NO>23782.1</PART_NO>
                            <QUANTITY>3312.0</QUANTITY>
                            <REMARKS>GTP1900003</REMARKS>
                            <SEQUENCE_NO>1.0</SEQUENCE_NO>
                        </INBOUND_ORDER_RECEIPT_LINE>
                    </INBOUND_ORDER_RECEIPT_LINES>
                </INBOUND_ORDER_RECEIPT_PALLET>
                <INBOUND_ORDER_RECEIPT_PALLET>
                    <PALLET_ID>F3157715</PALLET_ID>
                    <INBOUND_ORDER_RECEIPT_LINES>
                        <INBOUND_ORDER_RECEIPT_LINE>
                            <BATCH_NO>DUMMY</BATCH_NO>
                            <BOX_SIZE>92.0</BOX_SIZE>
                            <BOX_WEIGHT>2.75</BOX_WEIGHT>
                            <COUNTRY_OF_ORIGIN>CN</COUNTRY_OF_ORIGIN>
                            <CUSTOMS_STAT_NO>821210100</CUSTOMS_STAT_NO>
                            <DELNOTE_NO>136673</DELNOTE_NO>
                            <DIMENSIONS>0.36x0.33x0.175</DIMENSIONS>
                            <EXPIRY_DATE>2013-05-08T00:00:00.000+00:00</EXPIRY_DATE>
                            <LOCATION_NO>O</LOCATION_NO>
                            <PART_NO>23782.1</PART_NO>
                            <QUANTITY>3312.0</QUANTITY>
                            <REMARKS>GTP1900003</REMARKS>
                            <SEQUENCE_NO>2.0</SEQUENCE_NO>
                        </INBOUND_ORDER_RECEIPT_LINE>
                    </INBOUND_ORDER_RECEIPT_LINES>
                </INBOUND_ORDER_RECEIPT_PALLET>
                <INBOUND_ORDER_RECEIPT_PALLET>
                    <PALLET_ID>M3157716</PALLET_ID>
                    <INBOUND_ORDER_RECEIPT_LINES>
                        <INBOUND_ORDER_RECEIPT_LINE>
                            <BATCH_NO>DUM20150601</BATCH_NO>
                            <BOX_SIZE>500.0</BOX_SIZE>
                            <BOX_WEIGHT>1.795</BOX_WEIGHT>
                            <COUNTRY_OF_ORIGIN>PL</COUNTRY_OF_ORIGIN>
                            <CUSTOMS_STAT_NO>330499000</CUSTOMS_STAT_NO>
                            <DELNOTE_NO>136673</DELNOTE_NO>
                            <DIMENSIONS>0.23x0.195x0.22</DIMENSIONS>
                            <EXPIRY_DATE>2013-05-08T00:00:00.000+00:00</EXPIRY_DATE>
                            <LOCATION_NO>O</LOCATION_NO>
                            <PART_NO>24933.1</PART_NO>
                            <QUANTITY>23000.0</QUANTITY>
                            <REMARKS>GTP1900003</REMARKS>
                            <SEQUENCE_NO>8.0</SEQUENCE_NO>
                        </INBOUND_ORDER_RECEIPT_LINE>
                    </INBOUND_ORDER_RECEIPT_LINES>
                </INBOUND_ORDER_RECEIPT_PALLET>
                <INBOUND_ORDER_RECEIPT_PALLET>
                    <PALLET_ID>M3157717</PALLET_ID>
                    <INBOUND_ORDER_RECEIPT_LINES>
                        <INBOUND_ORDER_RECEIPT_LINE>
                            <BATCH_NO>DUM20150601</BATCH_NO>
                            <BOX_SIZE>210.0</BOX_SIZE>
                            <BOX_WEIGHT>4.49</BOX_WEIGHT>
                            <COUNTRY_OF_ORIGIN>PL</COUNTRY_OF_ORIGIN>
                            <CUSTOMS_STAT_NO>330420000</CUSTOMS_STAT_NO>
                            <DELNOTE_NO>136673</DELNOTE_NO>
                            <DIMENSIONS>0.39x0.355x0.12</DIMENSIONS>
                            <EXPIRY_DATE>2013-05-08T00:00:00.000+00:00</EXPIRY_DATE>
                            <LOCATION_NO>O</LOCATION_NO>
                            <PART_NO>26195.1</PART_NO>
                            <QUANTITY>14070.0</QUANTITY>
                            <REMARKS>GTP1900003</REMARKS>
                            <SEQUENCE_NO>9.0</SEQUENCE_NO>
                        </INBOUND_ORDER_RECEIPT_LINE>
                    </INBOUND_ORDER_RECEIPT_LINES>
                </INBOUND_ORDER_RECEIPT_PALLET>
                <INBOUND_ORDER_RECEIPT_PALLET>
                    <PALLET_ID>M3157718</PALLET_ID>
                    <INBOUND_ORDER_RECEIPT_LINES>
                        <INBOUND_ORDER_RECEIPT_LINE>
                            <BATCH_NO>DUM20140901</BATCH_NO>
                            <BOX_SIZE>36.0</BOX_SIZE>
                            <BOX_WEIGHT>1.35</BOX_WEIGHT>
                            <COUNTRY_OF_ORIGIN>CN</COUNTRY_OF_ORIGIN>
                            <CUSTOMS_STAT_NO>330420000</CUSTOMS_STAT_NO>
                            <DELNOTE_NO>136673</DELNOTE_NO>
                            <DIMENSIONS>0.18x0.17x0.11</DIMENSIONS>
                            <EXPIRY_DATE>2013-05-08T00:00:00.000+00:00</EXPIRY_DATE>
                            <LOCATION_NO>O</LOCATION_NO>
                            <PART_NO>24810.1</PART_NO>
                            <QUANTITY>1260.0</QUANTITY>
                            <REMARKS>GTP1900003</REMARKS>
                            <SEQUENCE_NO>6.0</SEQUENCE_NO>
                        </INBOUND_ORDER_RECEIPT_LINE>
                        <INBOUND_ORDER_RECEIPT_LINE>
                            <BATCH_NO>DUM20140901</BATCH_NO>
                            <BOX_SIZE>36.0</BOX_SIZE>
                            <BOX_WEIGHT>1.35</BOX_WEIGHT>
                            <COUNTRY_OF_ORIGIN>CN</COUNTRY_OF_ORIGIN>
                            <CUSTOMS_STAT_NO>330420000</CUSTOMS_STAT_NO>
                            <DELNOTE_NO>136673</DELNOTE_NO>
                            <DIMENSIONS>0.18x0.17x0.11</DIMENSIONS>
                            <EXPIRY_DATE>2013-05-08T00:00:00.000+00:00</EXPIRY_DATE>
                            <LOCATION_NO>O</LOCATION_NO>
                            <PART_NO>24810.1</PART_NO>
                            <QUANTITY>2340.0</QUANTITY>
                            <REMARKS>GTP1900003</REMARKS>
                            <SEQUENCE_NO>7.0</SEQUENCE_NO>
                        </INBOUND_ORDER_RECEIPT_LINE>
                    </INBOUND_ORDER_RECEIPT_LINES>
                </INBOUND_ORDER_RECEIPT_PALLET>
                <INBOUND_ORDER_RECEIPT_PALLET>
                    <PALLET_ID>M3157719</PALLET_ID>
                    <INBOUND_ORDER_RECEIPT_LINES>
                        <INBOUND_ORDER_RECEIPT_LINE>
                            <BATCH_NO>DUMMY</BATCH_NO>
                            <BOX_SIZE>92.0</BOX_SIZE>
                            <BOX_WEIGHT>2.75</BOX_WEIGHT>
                            <COUNTRY_OF_ORIGIN>CN</COUNTRY_OF_ORIGIN>
                            <CUSTOMS_STAT_NO>821210100</CUSTOMS_STAT_NO>
                            <DELNOTE_NO>136673</DELNOTE_NO>
                            <DIMENSIONS>0.36x0.33x0.175</DIMENSIONS>
                            <EXPIRY_DATE>2013-05-08T00:00:00.000+00:00</EXPIRY_DATE>
                            <LOCATION_NO>O</LOCATION_NO>
                            <PART_NO>23782.1</PART_NO>
                            <QUANTITY>184.0</QUANTITY>
                            <REMARKS>GTP1900003</REMARKS>
                            <SEQUENCE_NO>3.0</SEQUENCE_NO>
                        </INBOUND_ORDER_RECEIPT_LINE>
                        <INBOUND_ORDER_RECEIPT_LINE>
                            <BATCH_NO>DUMMY</BATCH_NO>
                            <BOX_SIZE>92.0</BOX_SIZE>
                            <BOX_WEIGHT>2.75</BOX_WEIGHT>
                            <COUNTRY_OF_ORIGIN>CN</COUNTRY_OF_ORIGIN>
                            <CUSTOMS_STAT_NO>821210100</CUSTOMS_STAT_NO>
                            <DELNOTE_NO>136673</DELNOTE_NO>
                            <DIMENSIONS>0.36x0.33x0.175</DIMENSIONS>
                            <EXPIRY_DATE>2013-05-08T00:00:00.000+00:00</EXPIRY_DATE>
                            <LOCATION_NO>O</LOCATION_NO>
                            <PART_NO>23782.1</PART_NO>
                            <QUANTITY>368.0</QUANTITY>
                            <REMARKS>GTP1900003</REMARKS>
                            <SEQUENCE_NO>5.0</SEQUENCE_NO>
                        </INBOUND_ORDER_RECEIPT_LINE>
                        <INBOUND_ORDER_RECEIPT_LINE>
                            <BATCH_NO>DUMMY</BATCH_NO>
                            <BOX_SIZE>92.0</BOX_SIZE>
                            <BOX_WEIGHT>2.75</BOX_WEIGHT>
                            <COUNTRY_OF_ORIGIN>CN</COUNTRY_OF_ORIGIN>
                            <CUSTOMS_STAT_NO>821210100</CUSTOMS_STAT_NO>
                            <DELNOTE_NO>136673</DELNOTE_NO>
                            <DIMENSIONS>0.36x0.33x0.175</DIMENSIONS>
                            <EXPIRY_DATE>2013-05-08T00:00:00.000+00:00</EXPIRY_DATE>
                            <LOCATION_NO>O</LOCATION_NO>
                            <PART_NO>23782.1</PART_NO>
                            <QUANTITY>2024.0</QUANTITY>
                            <REMARKS>GTP1900003</REMARKS>
                            <SEQUENCE_NO>4.0</SEQUENCE_NO>
                        </INBOUND_ORDER_RECEIPT_LINE>
                    </INBOUND_ORDER_RECEIPT_LINES>
                </INBOUND_ORDER_RECEIPT_PALLET>
            </INBOUND_ORDER_RECEIPT_PALLETS>
        </INBOUND_ORDER_RECEIPT>
    </soap:Body>
</soap:Envelope>